#include <stdio.h>

int main(void) {
	double t1, t2, t3;
	// Оголошуємо три змінні, які відповідають за час, за який кожен гість може з'їсти пиріг, відповідно 

	printf("Input three numbers: ");
	
	scanf_s("%lf %lf %lf", &t1, &t2, &t3);
	
	double tot_amount = (1.0 / t1) + (1.0 / t2) + (1.0 / t3);
	// Загальна продуктивність гостей (тобто яку саме частину пирога може з'їсти кожен гість за годину)
	
	double total_time = 1.0/tot_amount;
	//  Обчислюємо загальний час, який знадобиться трьом гостям, щоб з'їсти пиріг (що буде обернено дорівнювати їхній продуктивності)
	
	printf("Total time to eat the pie: %0.2f", total_time);
}
