#include <stdio.h>

long long countNumbers(int p) {
    if (p == 0) return 0;
    if (p == 1) return 2; // 5, 9

    // dp[i][0] - кількість чисел довжиною i, які закінчуються на 5
    // dp[i][1] - кількість чисел довжиною i, які закінчуються на 9
    // dp[i][2] - кількість чисел довжиною i, які закінчуються на дві 5 підряд
    // dp[i][3] - кількість чисел довжиною i, які закінчуються на дві 9 підряд
    long long dp[p + 1][4];

    dp[1][0] = 1; // 5
    dp[1][1] = 1; // 9
    dp[1][2] = 0;
    dp[1][3] = 0;

    for (int i = 2; i <= p; ++i) {
        dp[i][0] = dp[i-1][1] + dp[i-1][3];  // числа, які закінчуються на 9 або дві 9, до яких додаємо 5
        dp[i][1] = dp[i-1][0] + dp[i-1][2];  // числа, які закінчуються на 5 або дві 5, до яких додаємо 9
        dp[i][2] = dp[i-1][0];               // числа, які закінчуються на 5, до яких додаємо ще 5
        dp[i][3] = dp[i-1][1];               // числа, які закінчуються на 9, до яких додаємо ще 9
    }

    return dp[p][0] + dp[p][1] + dp[p][2] + dp[p][3];
}

int main() {
    int p;
    printf("Введіть кількість розрядів p (від 1 до 30): ");
    scanf("%d", &p);
    printf("Кількість  можливих чисел із %d розрядів: %lld\n", p, countNumbers(p));
    return 0;
}
